<a href="https://colab.research.google.com/github/LuisFernandoZuluaga/Entrega_Final_Gestion_y_Almacenamiento/blob/main/Ejemplo_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import sqlite3 as sql

#creamos la BD
def createDB():
  conn=sql.connect("Clase.db")#si no existe la crea
  conn.commit()
  conn.close()
  print("Cree la base de datos")

  #Creamos la tabla
def tableDB():
  conn=sql.connect("Clase.db")
  cursor=conn.cursor()
  cursor.execute("""CREATE TABLE estudiantes(
    id INT,
    nombre TEXT,
    apellido TEXT,
    edad INT,
    correo TEXT
  );""")
  conn.commit()
  conn.close()
  print("Cree la tabla")

def insertarRow(id, nombre, apellido, edad, correo):
  conn=sql.connect("Clase.db")
  cursor=conn.cursor()
  query=f"INSERT INTO estudiantes VALUEs ({id},'{nombre}','{apellido}', {edad}, '{correo}');"
  cursor.execute(query)
  conn.commit()
  conn.close()
  print(f"Inserte el estudiante: {nombre}")

#insertar varias filas
def insertRows(List):
  conn=sql.connect("Clase.db")
  cursor=conn.cursor()
  query=f"INSERT INTO estudiantes VALUES (?,?,?,?,?);"
  cursor.executemany(query,List)
  conn.commit()
  conn.close()
  print("Agregue varios estudiantes")

#Funcion para ver las filas
def selectRows(field):
  conn=sql.connect("Clase.db")
  cursor=conn.cursor()
  query=f"SELECT * FROM estudiantes ORDER By {field} DESC;"
  cursor.execute(query)
  datos=cursor.fetchall()
  conn.commit()
  print(datos)
  conn.close

def updatefield():
  conn=sql.connect('Clase.db')
  cursor=conn.cursor()
  query=f"UPDATE estudiantes SET edad=20 WHERE nombre like 'Andres';"
  cursor.execute(query)
  conn.commit()
  conn.close()
  print('Actualice un registro')

def delete():
  conn=sql.connect("Clase.db")
  cursor=conn.cursor()
  query=f"DELETE FROM estudiantes WHERE nombre like 'Andres';"
  cursor.execute(query)
  conn.commit()
  conn.close()
  print("Borre un registro")

#principal
if __name__ == "__main__":
  print("ejemplo sql")
  #createDB() #se comenta porque ya se creo
  #--------------
  #tableDB() #Se crea la tabla
  #-------------
  #insertarRow(214,'Luis','Zuluaga',30, 'n@gmail.com' )
  #------------------
  #lista=[(215,'Luis','Zuluaga',45,'J@gmail.com'),(216,'Andres','Zuluaga',40,'J@gmail.com')]
  #insertRows(lista)
  #--------------------
  #selectRows('edad')
  #------------------
  #updatefield()
  #----------
  #delete()
  #selectRows('edad')

ejemplo sql

In [2]:
import pandas as pd
import sqlite3 as sql

data={'nombre': ['Alicia', 'Marcela', 'Pedro', 'Luis','Santiago'],
      'edad': [25,30,35, 53, 30]}
df=pd.DataFrame(data)
df.head()

     nombre  edad
0    Alicia    25
1   Marcela    30
2     Pedro    35
3      Luis    53
4  Santiago    30

In [3]:
conn=sql.connect('base_2.db')
df.to_sql('personas', conn, if_exists="replace", index=False)
conn.close()

In [4]:
conn=sql.connect('base_2.db')
print("Me conecte a la base de datos")
cursor=conn.cursor()
query=f"SELECT * FROM personas;"
cursor.execute(query)
datos=cursor.fetchall()
conn.commit()
print(datos)
conn.close()

Me conecte a la base de datos
[('Alicia', 25), ('Marcela', 30), ('Pedro', 35), ('Luis', 53), ('Santiago', 30)]